[There seems no reason to treat Locale.ENGLISH specially here.

I think option D is the best.

i.e. leave the current behaviour as is (and make sure it's documented), but allow the Locale to be provided., Attached is a patch that adds overloaded versions of parseDate and parseDateStrictly with a Locale parameter (option D), plus unit tests. 

If a locale is supplied, the patterns will be interpreted using the date format symbols for that locale.

The original issue would then be addressed by:

{code}
d = DateUtils.parseDate("Wed, 09 Apr 2008 23:55:38 GMT", Locale.ENGLISH, 
        new String[] {"EEE, dd MMM yyyy HH:mm:ss zzz"});
{code}, Added tests to show current behaviour, i.e. ParseException occurs if default Locale does not match date:

URL: http://svn.apache.org/viewvc?rev=1388787&view=rev
Log:
LANG-799 Add tests to show ParseException when default Locale is wrong

Modified:
    commons/proper/lang/trunk/src/test/java/org/apache/commons/lang3/time/DateUtilsTest.java

Some of these would need to be changed if option D is not used., Not sure it's necessary for the code to check that the Locale is supported.
Seems to me such a check should be done by the caller if required., The patch breaks the tests I just added for UK and DE parsing.

This is because the patch now uses 
    parser.applyLocalizedPattern(pattern);
whereas previously it used
    parser.applyPattern(pattern);

I think it's wrong to assume that the patterns are localised; it will potentially break existing applications (just as it broke the tests I just added)., Applied patch with minor tweaks:
- dropped check for valid Locale
- use applyPattern not applyLocalizedPattern

URL: http://svn.apache.org/viewvc?rev=1388806&view=rev
Log:
LANG-799 - DateUtils#parseDate uses default locale; add Locale support

Modified:
    commons/proper/lang/trunk/src/changes/changes.xml
    commons/proper/lang/trunk/src/main/java/org/apache/commons/lang3/time/DateUtils.java
    commons/proper/lang/trunk/src/test/java/org/apache/commons/lang3/time/DateUtilsTest.java
, That last commit now breaks the build, as my test {{testParseNonSystemLocale()}} assumed the localized pattern change and now fails.

I suggest you add a couple of tests, based on your new tests. E.g. you have:

{code}
    // Parse German date with English Locale
    @Test(expected=ParseException.class)
    public void testLANG799_EN_FAIL() throws ParseException {
        Locale dflt = Locale.getDefault();
        Locale.setDefault(Locale.ENGLISH);
        try {
            DateUtils.parseDate("Mi, 09 Apr 2008 23:55:38 GMT", "EEE, dd MMM yyyy HH:mm:ss zzz");
        } finally {
            Locale.setDefault(dflt);            
        }
    }
{code}

And so I would now add, for example:

{code}
    // Parse German date with English Locale, specifying German Locale override
    @Test
    public void testLANG799_EN_WITH_DE_LOCALE() throws ParseException {
        Locale dflt = Locale.getDefault();
        Locale.setDefault(Locale.ENGLISH);
        try {
            DateUtils.parseDate("Mi, 09 Apr 2008 23:55:38 GMT", Locale.GERMAN, "EEE, dd MMM yyyy HH:mm:ss zzz");
        } finally {
            Locale.setDefault(dflt);            
        }
    }
{code}

You can ditch my test {{testParseNonSystemLocale}} and the associated {{getLongDateFormatForLocale}}., Please, ensure the tests ruin with Java 5 as well as with newer ones. And note, that the JDK switched the behavior between Java 5 and 6. Java 5 always uses English time zone short cuts (e.g. "CET" for Central European Time), while they are localized since Java 6 ("MEZ" for Mitteleuropäische Zeit)., Also, we should now remove {{testParseBadLocale()}} as we are no longer checking the Locale upon entry to the method., bq. That last commit now breaks the build, as my test testParseNonSystemLocale() assumed the localized pattern change and now fails.

Does not fail for me, even if I change the default Locale to Locale.GERMAN(Y), URL: http://svn.apache.org/viewvc?rev=1388818&view=rev
Log:
LANG-799 - DateUtils#parseDate uses default locale; add Locale support
Remove unnecessary test

Modified:
    commons/proper/lang/trunk/src/test/java/org/apache/commons/lang3/time/DateUtilsTest.java

URL: http://svn.apache.org/viewvc?rev=1388821&view=rev
Log:
LANG-799 - DateUtils#parseDate uses default locale; add Locale support
Parse German date with English Locale, specifying German Locale override

Modified:
    commons/proper/lang/trunk/src/test/java/org/apache/commons/lang3/time/DateUtilsTest.java, bq. Please, ensure the tests ruin with Java 5 as well as with newer ones. 

The pom specifies Java 1.6 for Lang3

bq. And note, that the JDK switched the behavior between Java 5 and 6. Java 5 always uses English time zone short cuts (e.g. "CET" for Central European Time), while they are localized since Java 6 ("MEZ" for Mitteleuropäische Zeit).

Not sure what that refers to; sounds like a separate bug (if any)., bq. Does not fail for me, even if I change the default Locale to Locale.GERMAN(Y)

This appears to be related to Java version. I was inadvertently compiling and executing the tests with JDK 7 not 6. The test passes under 6 and fails under 7., Java 7 has many more Locales. It so happens that the first different format string for Java 1.7 use formatting entries that are not in the standard pattern.

Removed the test, as it no longer applies (we don't use localized formats)

URL: http://svn.apache.org/viewvc?rev=1389172&view=rev
Log:
LANG-799 - DateUtils#parseDate uses default locale; add Locale support
Remove inappropriate test - we don't use localized formats

Modified:
    commons/proper/lang/trunk/src/test/java/org/apache/commons/lang3/time/DateUtilsTest.java
]